       IDENTIFICATION DIVISION.
       PROGRAM-ID. subcount.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CNT PIC 9(6) VALUE 0.
       LINKAGE SECTION.
       01 RESULT PIC 9(6).
       PROCEDURE DIVISION USING RESULT.
           ADD 1 TO CNT.
           MOVE CNT TO RESULT.
           EXIT PROGRAM.
